---
kind: method
id: M:Autodesk.Revit.DB.FamilySizeTableManager.RemoveSizeTable(System.String)
source: html/04e4938e-bef5-0a6a-2f44-c8e7428be37b.htm
---
# Autodesk.Revit.DB.FamilySizeTableManager.RemoveSizeTable Method

Removes the FamilySizeTable of a given name.

## Syntax (C#)
```csharp
public bool RemoveSizeTable(
	string tableName
)
```

## Parameters
- **tableName** (`System.String`) - The FamilySizeTable name.

## Returns
True if successful, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null